bashyal/Applications/Solvers/fineDEMfoam/fineDEMfoam_test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       231600;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       232000;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4000;
        startFace       232400;
    }
    top
    {
        type            patch;
        nFaces          4000;
        startFace       236400;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8000;
        startFace       240400;
    }
)

// ************************************************************************* //
