bashyal/Applications/Solvers/fineDEMfoam/fineDEMfoam_test/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    location "constant";
    object HFDIBDEMDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bodyNames (particle1 particle2 particle3 particle4 particle5);

stepDEM 0.01;
recordSimulation true;
nSolidsInDomain 10;
surfaceThreshold 0.5;

DEM {
    materials {
        sand {
            Y 1e7;
            nu 0.3;
            mu 0.5;
            adhN 0;
            eps 0.8;
        }
    }

    collisionPatches {
        bottom {
            material sand;
            nVec (0 1 0);
            planePoint (0 0 0);
        }
    }
}

interpolationSchemes {
    method leastSquares;

    leastSquaresCoeffs {
        distFactor 1.5;
        radiusFactor 1.5;
        angleFactor 1.5;
        maxCCRows 20;
    }
}

particle1 {
    bodyGeom convex;

    bodyAddition {
        addModel once;
        position (0.1 0.01 0.05);
        orientation (1 0 0 0 1 0 0 0 1);
    }

    material sand;
    rho rho [1 -3 0 0 0 0 0] 2650;

    fullyCoupledBody {}
}

particle2 {
    bodyGeom convex;

    bodyAddition {
        addModel once;
        position (0.2 0.01 0.05);
        orientation (1 0 0 0 1 0 0 0 1);
    }

    material sand;
    rho rho [1 -3 0 0 0 0 0] 2650;

    fullyCoupledBody {}
}

particle3 {
    bodyGeom convex;

    bodyAddition {
        addModel once;
        position (0.3 0.01 0.05);
        orientation (1 0 0 0 1 0 0 0 1);
    }

    material sand;
    rho rho [1 -3 0 0 0 0 0] 2650;

    fullyCoupledBody {}
}

particle4 {
    bodyGeom convex;

    bodyAddition {
        addModel once;
        position (0.4 0.01 0.05);
        orientation (1 0 0 0 1 0 0 0 1);
    }

    material sand;
    rho rho [1 -3 0 0 0 0 0] 2650;

    fullyCoupledBody {}
}

particle5 {
    bodyGeom convex;

    bodyAddition {
        addModel once;
        position (0.5 0.01 0.05);
        orientation (1 0 0 0 1 0 0 0 1);
    }

    material sand;
    rho rho [1 -3 0 0 0 0 0] 2650;

    fullyCoupledBody {}
}

// ************************************************************************* //